season = {'зима': (1, 2, 12), 'весна': (3, 4, 5), 'лето': (6, 7, 8), 'осень': (9, 10, 11)}

month = int(input('Введите любой месяц в виде целого числа от 1 до 12: '))
for key in season.keys():
    if month in season [key]:
        print(key)

# верный вариант
seasons_list = ['зима', 'зима', 'весна', 'весна', 'весна', 'лето', 'лето', 'лето', 'осень', 'осень', 'осень', 'зима']
seasons_dict = {1: 'зима', 2: 'зима', 3: 'весна', 4: 'весна', 5: 'весна', 6: 'лето', 7: 'лето', 8: 'лето', 9: 'осень',
                10: 'осень', 11: 'осень', 12: 'зима'}
month = int(input('введите номер месяца '))
if month in seasons_dict:
    print(seasons_list[month - 1]) # номерация с нуля
    print(seasons_dict[month])
else:
    print('Нет такого месяца')

